//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.

/*
Console.WriteLine("Input three-digit integer number (-999 to 999)");
int num = Convert.ToInt32(Console.ReadLine());

if (num > -1000 & num < -99)
{
    int tmp = ((num - (num / 100) * 100) - num % 10) / 10;
    Console.WriteLine(tmp);
}
if (num < 1000 & num > 99)
{
    int tmp = ((num - (num / 100) * 100) - num % 10) / 10;
    Console.WriteLine(tmp);
}
*/

