//Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
/*
int Temp(int num)
{
    int tmp = ((num - (num / 100) * 100) - num % 10) / 10;
    return tmp;
}

Console.WriteLine("Input three-digit integer number (-999 to 999)");
int num = Convert.ToInt32(Console.ReadLine());

if (num > -1000 & num < -99)
{
    Console.WriteLine(Temp(num));
}
if (num < 1000 & num > 99)
{
    Console.WriteLine(Temp(num));
}
*/



