// Задача 1: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

/*

int max;
Console.WriteLine("Input first integer number");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second integer number");
int num2 = Convert.ToInt32(Console.ReadLine());

if (num1>num2)
    max = num1;

else 
    max = num2;

Console.WriteLine("max number is " + max);

*/

// Задача 2: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.

/*

int max;
Console.WriteLine("Input first integer number");
int num1 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input second integer number");
int num2 = Convert.ToInt32(Console.ReadLine());
Console.WriteLine("Input third integer number");
int num3 = Convert.ToInt32(Console.ReadLine());

max=num1;

if(num2>max)
    max=num2;

if(num3>max)
    max=num3;

Console.WriteLine("max number is " + max);

*/

// Задача 3: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

/*
Console.WriteLine("Input integer number");
int num = Convert.ToInt32(Console.ReadLine());

if ( num % 2 == 0)
    Console.WriteLine("even number");
else 
    Console.WriteLine("odd number");

    */

    